In [1]:
import pandas as pd

In [4]:
TMUS_df = pd.read_csv("TMUS.csv")

In [5]:
TMUS_df.head()

         Date   Open       High    Low  Close  Adj Close     Volume
0  2010-01-01  15.48  16.280001  11.04  11.26   9.155951   90731000
1  2010-02-01  11.32  13.520000  11.24  12.34  10.034142   63899000
2  2010-03-01  12.48  14.500000  11.98  14.16  11.514055   53912000
3  2010-04-01  14.20  15.980000  14.12  15.26  12.408509   56518000
4  2010-05-01  15.46  18.540001  14.24  17.98  14.620247  128512900

In [6]:
TMUS_df = TMUS_df.rename(columns = {'Adj Close': 'TMUS'})
TMUS_df.head()

         Date   Open       High    Low  Close       TMUS     Volume
0  2010-01-01  15.48  16.280001  11.04  11.26   9.155951   90731000
1  2010-02-01  11.32  13.520000  11.24  12.34  10.034142   63899000
2  2010-03-01  12.48  14.500000  11.98  14.16  11.514055   53912000
3  2010-04-01  14.20  15.980000  14.12  15.26  12.408509   56518000
4  2010-05-01  15.46  18.540001  14.24  17.98  14.620247  128512900

In [9]:
TMUS_clean = TMUS_df[['Date','TMUS']]
TMUS_clean.head()

         Date       TMUS
0  2010-01-01   9.155951
1  2010-02-01  10.034142
2  2010-03-01  11.514055
3  2010-04-01  12.408509
4  2010-05-01  14.620247

In [10]:
len(TMUS_clean)

120

In [11]:
len(TMUS_clean.dropna())

120